---
kind: method
id: M:Autodesk.Revit.DB.BaseArray.GetOriginalMemberIds
source: html/8c15fb58-a534-abd4-0715-841ea1c1447f.htm
---
# Autodesk.Revit.DB.BaseArray.GetOriginalMemberIds Method

Retrieves the original member Ids of the Array.

## Syntax (C#)
```csharp
public abstract ICollection<ElementId> GetOriginalMemberIds()
```

## Returns
The original member Ids of the Array